## Plan Result (Managed_Identity_prod - Managed_Identity)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.genesis_rg_contributor[0]
* Update
  * azurerm_user_assigned_identity.sops-mi
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.genesis_rg_contributor[0] will be created
  + resource "azurerm_role_assignment" "genesis_rg_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "718712f6-94f0-4014-b7f7-c8a0ce967894"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/genesis-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.sops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "sops-mi" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-prod-mi"
        name                = "aks-prod-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "wi-admin-mi" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/managed-identities-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/admin-prod-mi"
        name                = "admin-prod-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label Managed_Identity_prod - Managed_Identity/add-or-update: POST https://api.github.com/repos/hmcts/aks-cft-deploy/issues/695/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":695,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_prod - Managed_Identity","Vars":{}} -->